# Используем официальный Node.js образ как базовый
FROM node:16

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY ./server/package*.json ./  # Указываем, что package.json находится в папке server

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы проекта в контейнер
COPY ./server .  # Копируем все из папки server

# Указываем порт, который будет использоваться приложением
EXPOSE 5000

# Команда для запуска приложения
CMD ["npm", "run", "dev"]
